Update sa to use ASCII art, and update orchistration to not push
